{
  "adapter_type": "lora",
  "auto_mapping": {
    "q_proj": "lora_A",
    "k_proj": "lora_A",
    "v_proj": "lora_A",
    "o_proj": "lora_B",
    "gate_proj": "lora_A",
    "up_proj": "lora_A",
    "down_proj": "lora_B"
  },
  "base_model_name_or_path": "Ace-v4.2",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "modules_to_save": ["embed_tokens", "lm_head"],
  "peft_type": "LORA",
  "r": 8,
  "revision": null,
  "target_modules": [
    "q_proj",
    "k_proj",
    "v_proj",
    "o_proj",
    "gate_proj",
    "up_proj",
    "down_proj"
  ],
  "task_type": "CAUSAL_LM"
}
